[
  {
    "osbbNewsId": 1,
    "title": "Firefox 79: The safe return of shared memory",
    "date": [
      2020,
      1,
      15
    ],
    "article": "Modern JavaScript depends on promises, async/await, events, and timeouts to orchestrate complex scheduling between your code, libraries, and the browser. And yet, it can be challenging to debug async code to understand control and data flow. Operations are broken up over time. Async stack traces solve this by combining the live synchronous part of the stack with the part that is captured and asynchronous. Now you can enjoy detailed async execution chains in the Firefox JavaScript Debugger’s call stack, Console errors, and Network initiators.",
    "important": true,
    "image": ["https://picsum.photos/seed/picsum/400/250", "https://picsum.photos/seed/picsum/400/250", "https://picsum.photos/seed/picsum/400/250", "https://picsum.photos/seed/picsum/400/250"],
    "pinned": true,
    "commented": false,
    "osbbDtoOLD": null
  },
  {
    "osbbNewsId": 2,
    "title": "MDN Web Docs: 15 years young",
    "date": [
      2019,
      8,
      22
    ],
    "article": "On July 23, MDN Web Docs turned 15 years old. From humble beginnings, rising out of the ashes of Netscape DevEdge, MDN has grown to be one of the best-respected web platform documentation sites out there. Our popularity is growing, and new content and features arrive just about every day. When we turned 10, we had a similar celebration, talking about MDN Web Docs’ origins, history, and what we’d achieved up until then. Refer to MDN at ten if you want to go further back! In the last five years, we’ve broken much more ground. These days, we can boast roughly 15 million views per month, a comprehensive browser compatibility database, an active beginner’s learning community, editable interactive examples, and many other exciting features that didn’t exist in 2015. An anniversary to be proud of! ",
    "important": false,
    "image": ["https://picsum.photos/seed/picsum/400/250", "https://picsum.photos/seed/picsum/400/250", "https://picsum.photos/seed/picsum/400/250"],
    "pinned": false,
    "commented": true,
    "osbbDtoOLD": null
  },
  {
    "osbbNewsId": 3,
    "title": "We’ve got an MDN Web Docs Swag Store",
    "date": [
      2019,
      9,
      25
    ],
    "article": "Launched earlier this year, the MDN Web Docs Store is the place to go to show your support for web standards documentation and get your MDN Web Docs merchandise. Whether it’s clothing, bags, or other accessories featuring your favorite dino head or MDN Web Docs logos, we’ve got something for you.  And, for a limited time only, you can pick up special 15th anniversary designs",
    "important": true,
    "image": [],
    "pinned": false,
    "commented": true,
    "osbbDtoOLD": null
  },
  {
    "osbbNewsId": 4,
    "title": "MDN’s audience has grown like never before",
    "date": [
      2020,
      1,
      15
    ],
    "article": "In 2015, MDN served 4.5 million users on a monthly basis. A year later, we launched a product strategy designed to better serve Web Developers and increase MDN’s reach. We improved the site’s performance significantly. Page load time has gone down from 5s to 3.5s for the slowest 90th percentile on MDN, in the last two years alone. We fixed many issues that made it harder to surface MDN results in search engines, from removing spam to removing hundreds of thousands of pages from indexing. We listened to users to address an under-served audience on MDN: action-oriented developers, those who like actionable information right away. You can read below about some of the specific changes we made to better serve this audience. With over 3,000 new articles in the last 3 years, 260,000 article edits, and all the other goodness you can read about here, MDN has grown in double-digit percentages, year over year, every year — since 2015. Today MDN is serving more than 15 million web developers on a monthly basis. And, it’s serving them better than ever before.",
    "important": true,
    "image": ["https://picsum.photos/seed/picsum/400/250"],
    "pinned": true,
    "commented": false,
    "osbbDtoOLD": null
  },
  {
    "osbbNewsId": 5,
    "title": "Satisfaction guaranteed",
    "date": [
      2020,
      1,
      15
    ],
    "article": "When we first started tracking task completion and satisfaction on MDN Web Docs 4 years ago, we were thrilled to see that more than 78% of MDN users were either satisfied or very satisfied with MDN, and 87% of MDN users reported that they were able to complete the task that brought them to the site. Since then it has been our goal to address a larger share of the developer audience while still maintaining these levels of satisfaction and task completion. Today, even though we have tripled our audience size, the share of people satisfied or very satisfied with MDN has gone up to 80%. Task completion has increased to a phenomenal 92%.",
    "important": true,
    "image": ["https://picsum.photos/seed/picsum/400/250", "https://picsum.photos/seed/picsum/400/250", "https://picsum.photos/seed/picsum/400/250", "https://picsum.photos/seed/picsum/400/250"],
    "pinned": true,
    "commented": false,
    "osbbDtoOLD": null
  },
  {
    "osbbNewsId": 6,
    "title": "The learning area: MDN becomes beginner-friendly",
    "date": [
      2020,
      1,
      15
    ],
    "article": "Around the middle of 2015, the writers’ team began to act on user feedback that MDN wasn’t very beginner-friendly. We heard from novice web developers that MDN had been recommended as a good source of documentation. However, when they went to check out the site, they found it too advanced for their needs. In response to this feedback, we started the Learn Web Development section, informally known as the learning area. This area initially covered a variety of beginner’s topics ranging from what tools you need and how to get content on the web, to the very basics of web languages like HTML, CSS, and JavaScript. Getting started with the web was the first fully-fledged learning module to be published. It paved the way nicely for what was to come.",
    "important": true,
    "image": ["https://picsum.photos/seed/picsum/400/250", "https://picsum.photos/seed/picsum/400/250", "https://picsum.photos/seed/picsum/400/250", "https://picsum.photos/seed/picsum/400/250"],
    "pinned": true,
    "commented": false,
    "osbbDtoOLD": null
  }
]
